bin/ExternalDataProcessors/ВнешняяОбработкаТЗ_effectmobile_ru.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ExternalDataProcessor>
		<Properties>
			<Name>ВнешняяОбработкаТЗ_effectmobile_ru</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеИсключения</Name>
					<Comment>служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОператорСравнения</Name>
					<Comment>Укажите "Равно" или "Не равно"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДатыСравнения</Name>
					<Comment>Сравниваем с "Min" или "Max" датой?</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаНужныеВедомости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Ведомость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВедомости</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВедомости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExternalDataProcessor>
</MetaDataObject>

bin/ExternalDataProcessors/ВнешняяОбработкаТЗ_effectmobile_ru/Forms/Форма/Ext/Form/Module.bsl
//#Область Иницализация
//	ДатаОтправки = '20260415';
//	ОператорСравнения = Неопределено;
//	ХарактеристикаДатыСравнения = Неопределено;
//	#КонецОбласти

//#Область ОписаниеОбработки
//// 
//// Вид обработки: Проверка знаний кандидата
//// Версия обработки: 1.1.1.1
//// Дата создания: 07.03.2026
//// Создал: Кулебакин Н.А.
//// Описание: Обработка предназначена для проверки знаний кандидата по заданным параметрам
////		и выдачи результата в виде таблицы "Нужные ведомости".
////		Параметры для проверки: Дата проверки, Оператор сравнения, Характеристика даты договора, Ведомость.
////		Реализованы алгоритмы проверки по дополнительным (динамическим) условиям:
////		1. Условия исключения лишнего реализованы в коде автоматически
////		2. Кандидатам мужчинам реализовать условное оформление через программный код (окрас строки
////			 в светло-зеленый цвет), для женщин через конфигуратор - не реализован, 
////			 т.к. он мешает реализации через программный код. 
////		3. Вывода информационного сообщения об удаленных ведомостях реализовано из критерия, что 
////			количество символов в фамилии кандидата 8-9 шт.- через произвольную форму. 
	
//#КонецОбласти

#Область КлиентскиеПроцедурыИФункции
&НаКлиенте
// Заполняет таблицу "Нужные ведомости" данными из таблицы "Все ведомости" по заданным параметрам
Процедура ЗаполнитьНужное(Команда)
// Проверяет на заполненность необходимых параметров
	Ошибки = "";

	Если Не ЗначениеЗаполнено(Объект.ОператорСравнения) Тогда
		Ошибки = Ошибки + "• Не выбрано условие сравнения (Равно/Не равно)" + Символы.ПС;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ХарактеристикаДатыСравнения) Тогда
		Ошибки = Ошибки + "• Не выбран параметр даты сравнения (Min/Max)" + Символы.ПС;
	КонецЕсли;

	Если Не ПустаяСтрока(Ошибки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбраны нужные параметры:" + Символы.ПС + Ошибки;
		Сообщение.Сообщить();
	Иначе
		ЗаполнитьНужноеНаСервере(Объект.ДатаОтправки, Объект.ОператорСравнения, Объект.ХарактеристикаДатыСравнения);
	КонецЕсли;

КонецПроцедуры

//&НаКлиенте
//// Удаляет строки из таблицы "Нужные ведомости" по заданным параметрам
//// и выводит информацию об удаленных строках
//Процедура УдалитьЛишнее(Команда)
//		
//	УдаленныеНомера = УдалитьЛишнееНаСервере();
//	ВывестиИнформациюОбУдаленииНаКлиенте(УдаленныеНомера);
//	
//КонецПроцедуры
//
//&НаКлиенте
//// Выводит информацию об удаленных строках
//Процедура ВывестиИнформациюОбУдаленииНаКлиенте(УдаленныеНомера)
//
//	УдаленныеНомера.СортироватьПоЗначению(НаправлениеСортировки.Возр);
//
//	Количество = УдаленныеНомера.Количество();
//
//	МассивНомеров = Новый Массив;
//	Для Каждого ЭлементСписка Из УдаленныеНомера Цикл
//		МассивНомеров.Добавить(ЭлементСписка.Значение);
//	КонецЦикла;
//
//	ТекстСообщения = "Удалено документов:" + Количество + " (" + СтрСоединить(МассивНомеров, ", ") + ")";
//
//	// Алгоритм вывода информации для фамилии 8-9 символов (Кулебакин Н.А.),
//	// через создание и открытие произвольной формы
//
//	ПараметрыФормы = Новый Структура("Заголовок, Сообщение", "Информация об удалении", ТекстСообщения);
//
//	// Всегда открываем новую форму с уникальным ключом
//	ОткрытьФорму("Обработка.ПроверкаЗнанийКандидата.Форма.ИнформацияДляПользователя", ПараметрыФормы, , Истина);
//
//	// Алгоритм вывода информации для фамилии менее 6 символов,
//	// через вывод метод Сообщить()
//	// Сообщение = Новый СообщениеПользователю;
//	// Сообщение.Текст = ТекстСообщения;
//	// Сообщение.Сообщить();
//
//КонецПроцедуры

#КонецОбласти

#Область СерверныеПроцедурыИФункции

&НаСервере
// Заполняет таблицу ведомостей
Процедура ЗаполнитьНужноеНаСервере(ДатаОтправки, ОператорСравнения, ХарактеристикаДатыСравнения)
//
// 1. Получаем данные из запроса
// 2. Проверяем условия
// 3. Заполняем таблицу ведомостей
//
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ИсторияСтатусовДокументов.ДатаЗаписи) КАК ДатаЗаписи,
	|	ИсторияСтатусовДокументов.Документ
	|ПОМЕСТИТЬ МаксДатаСтатусаДокумента
	|ИЗ
	|	РегистрСведений.ИсторияСтатусовДокументов КАК ИсторияСтатусовДокументов
	|СГРУППИРОВАТЬ ПО
	|	ИсторияСтатусовДокументов.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияСтатусовДокументов.Документ КАК Документ,
	|	ИсторияСтатусовДокументов.Статус КАК АктуальныйСтатусДокумента
	|ПОМЕСТИТЬ АктуальныеСтатусыДокументовВТ
	|ИЗ
	|	МаксДатаСтатусаДокумента КАК МаксДатаСтатусаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСтатусовДокументов КАК ИсторияСтатусовДокументов
	|		ПО МаксДатаСтатусаДокумента.Документ = ИсторияСтатусовДокументов.Документ
	|		И МаксДатаСтатусаДокумента.ДатаЗаписи = ИсторияСтатусовДокументов.ДатаЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ведомость.Ссылка КАК Ведомость,
	|	Ведомость.Номер КАК НомерВедомости,
	|	Ведомость.Дата КАК ДатаВедомости,
	|	АктуальныеСтатусыДокументовВТ.АктуальныйСтатусДокумента КАК СтатусВедомости,
	|	Ведомость.Договоры.(
	|		НомерСтроки КАК НомерСтрокиТЧВедомости,
	|		Договор.Наименование КАК НаименованиеДоговора,
	|		Договор.НачалоДействия КАК НачалоДействияДоговора,
	|		Договор.Активен КАК ДоговорАктивен) КАК Договоры
	|ИЗ
	|	Документ.Ведомость КАК Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеСтатусыДокументовВТ КАК АктуальныеСтатусыДокументовВТ
	|		ПО АктуальныеСтатусыДокументовВТ.Документ = Ведомость.Ссылка
	|ГДЕ
	|	НЕ Ведомость.ПометкаУдаления";

	РезультатЗапроса 	= Запрос.Выполнить();
	ВыборкаДокументов 	= РезультатЗапроса.Выбрать();

//// Проверяем наличие реквизита в форме.
//	РеквизитыФормы = ПолучитьРеквизиты();
//	ИмяРеквизита = "РеквизитТаблицаНужныеВедомости";
//	РеквизитНайден = Ложь;
//
//	Для Каждого Реквизит Из РеквизитыФормы Цикл
//		Если Реквизит.Имя = ИмяРеквизита Тогда
//			РеквизитНайден = Истина;
//			Прервать;
//		КонецЕсли;
//	КонецЦикла;
//
//	Если Не РеквизитНайден Тогда
//		СоздатьТабличнуюЧастьНаФорме();
//	КонецЕсли;
	
// Получаем таблицу через РеквизитФормыВЗначение.
	ТаблицаНужныеВедомости = Объект.ТаблицаНужныеВедомости;
	ТаблицаНужныеВедомости.Очистить();
	
//Поместить данные из запроса в табличную часть формы с проверкой условий по датам.
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ПроверитьДокументы = ПроверитьДоговорыВДокументе(ВыборкаДокументов, ОператорСравнения,
			ХарактеристикаДатыСравнения, ДатаОтправки);

		Если ПроверитьДокументы Тогда
			НоваяСтрока 				= ТаблицаНужныеВедомости.Добавить();
			НоваяСтрока.Ведомость 		= ВыборкаДокументов.Ведомость;
			НоваяСтрока.ДатаВедомости 	= ВыборкаДокументов.ДатаВедомости;
			НоваяСтрока.СтатусВедомости = ВыборкаДокументов.СтатусВедомости;	
		КонецЕсли;

	КонецЦикла;
	
	ТаблицаНужныеВедомости.Сортировать("ДатаВедомости Возр"); // сортировка таблицы ведомостей по дате
	
//	ЗначениеВРеквизитФормы(ТаблицаНужныеВедомости, "РеквизитТаблицаНужныеВедомости");
	Элементы.ТаблицаНужныеВедомости.Видимость = Истина;
	УстановитьЦветСтрокиТаблицы();			
КонецПроцедуры

&НаСервере
//Процедура СоздатьТабличнуюЧастьНаФорме()
//	
//// Создаем описание реквизита формы - Таблица Значений
//	НовыеРеквизиты 	= Новый Массив;
//	ТаблицаЗначений	= Новый ОписаниеТипов("ТаблицаЗначений");
//	РеквизитТЧ 		= Новый РеквизитФормы("РеквизитТаблицаНужныеВедомости", ТаблицаЗначений);
//
//	НовыеРеквизиты.Добавить(РеквизитТЧ);
//	
//// Создаем колонки в ТаблицеЗначений (через РеквизитФормы)
//	ТипыКолонкаВедомость 	 = Новый ОписаниеТипов("ДокументСсылка.Ведомость");
//	ТипыКолонкаДатаВедомости = Новый ОписаниеТипов("Дата");
//	ТипыКолонкаСтатус 		 = Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыДокументов");
//	
//	
//	КолонкаВедомость	 = Новый РеквизитФормы("Ведомость", ТипыКолонкаВедомость, "РеквизитТаблицаНужныеВедомости");
//	КолонкаДатаВедомости = Новый РеквизитФормы("ДатаВедомости", ТипыКолонкаДатаВедомости, "РеквизитТаблицаНужныеВедомости");
//	КолонкаСтатус 		 = Новый РеквизитФормы("СтатусВедомости", ТипыКолонкаСтатус, "РеквизитТаблицаНужныеВедомости");
//	
//	НовыеРеквизиты.Добавить(КолонкаВедомость);
//	НовыеРеквизиты.Добавить(КолонкаДатаВедомости);
//	НовыеРеквизиты.Добавить(КолонкаСтатус);
//	
//// Изменяем реквизиты формы
//	ИзменитьРеквизиты(НовыеРеквизиты);
//	
//// Создаем или находим группу для таблицы
//	ГруппаНаФорме = Элементы.Найти("Ведомости");
//	Если ГруппаНаФорме = Неопределено Тогда
//		ГруппаНаФорме 					  = Элементы.Добавить("Ведомости", Тип("ГруппаФормы"));
//		ГруппаНаФорме.Заголовок 		  = "Ведомости";
//		ГруппаНаФорме.Вид				  = ВидГруппыФормы.ОбычнаяГруппа;
//		ГруппаНаФорме.ОтображатьЗаголовок = Ложь;
//	КонецЕсли;
//	
//// Создаем элемент формы типа ТаблицаФормы
//	ЭлементТаблица 				= Элементы.Добавить("РеквизитТаблицаНужныеВедомостиТаблица", Тип("ТаблицаФормы"), ГруппаНаФорме);
//	ЭлементТаблица.ПутьКДанным 	= "РеквизитТаблицаНужныеВедомости";
//	ЭлементТаблица.Отображение 	= ОтображениеТаблицы.Список;
//	ЭлементТаблица.Видимость 	= Истина;
//	
//// Создаем колонки таблицы формы как отдельные элементы ПолеФормы с родителем ЭлементТаблица
//	НовыйЭлемент 			 = Элементы.Добавить("РеквизитТаблицаНужныеВедомостиВедомость", Тип("ПолеФормы"), ЭлементТаблица);
//	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
//	НовыйЭлемент.ПутьКДанным = "РеквизитТаблицаНужныеВедомости.Ведомость";
//	
//	НовыйЭлемент 			 = Элементы.Добавить("РеквизитТаблицаНужныеВедомостиДатаВедомости", Тип("ПолеФормы"), ЭлементТаблица);
//	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
//	НовыйЭлемент.ПутьКДанным = "РеквизитТаблицаНужныеВедомости.ДатаВедомости";
//	
//	НовыйЭлемент 			 = Элементы.Добавить("РеквизитТаблицаНужныеВедомостиСтатусВедомости", Тип("ПолеФормы"), ЭлементТаблица);
//	НовыйЭлемент.Вид 		 = ВидПоляФормы.ПолеВвода;
//	НовыйЭлемент.ПутьКДанным = "РеквизитТаблицаНужныеВедомости.СтатусВедомости";
//	НовыйЭлемент.Видимость 	 = Ложь;
//	
//// Скрываем колонку Дата
//	КолонкаДаты = Элементы.Найти("РеквизитТаблицаНужныеВедомостиДатаВедомости");
//	Если КолонкаДаты <> Неопределено Тогда
//		КолонкаДаты.Видимость = Ложь;
//	КонецЕсли;
//
//КонецПроцедуры


&НаСервереБезКонтекста
// Функция проверяет наличие активных договоров в документе и проверяет условие по датам
Функция ПроверитьДоговорыВДокументе(ВыборкаДокументов, ОператорСравнения, ХарактеристикаДатыСравнения, ДатаОтправки)
	
	// Определяем параметры активных договоров в документе
	ПервыйАктивныйДоговор 	= Неопределено;
	МинимальнаяДата 		= Неопределено;
	МаксимальнаяДата 		= Неопределено;
	ДатаВедомости 			= ВыборкаДокументов.ДатаВедомости;
	
	ВыборкаДоговоров = ВыборкаДокументов.Договоры.Выбрать();
	Пока ВыборкаДоговоров.Следующий() Цикл
		Если ВыборкаДоговоров.ДоговорАктивен И ПервыйАктивныйДоговор = Неопределено Тогда
			ПервыйАктивныйДоговор = ВыборкаДоговоров.НачалоДействияДоговора;
		КонецЕсли;
		
		Если МинимальнаяДата = Неопределено Или ВыборкаДоговоров.НачалоДействияДоговора < МинимальнаяДата Тогда
			МинимальнаяДата = ВыборкаДоговоров.НачалоДействияДоговора;
		КонецЕсли;
		
		Если МаксимальнаяДата = Неопределено Или ВыборкаДоговоров.НачалоДействияДоговора > МаксимальнаяДата Тогда
			МаксимальнаяДата = ВыборкаДоговоров.НачалоДействияДоговора;
		КонецЕсли;
	КонецЦикла;
	
	// Проверяем условие по датам
	ПроверкаДатыДоговора 	= ПроверитьУсловиеДаты(ПервыйАктивныйДоговор, МинимальнаяДата, МаксимальнаяДата,
											ОператорСравнения, ХарактеристикаДатыСравнения);
	// Проверяем дополнительное условие по датам отправки
	ПроверкаДоп 			= ПроверитьПоДопУсловиям(ДатаОтправки, ДатаВедомости);
	Если ПроверкаДатыДоговора И ПроверкаДоп Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Проверяем условие по датам договора
Функция ПроверитьУсловиеДаты(ПервыйАктивныйДоговор, МинимальнаяДата, МаксимальнаяДата, ОператорСравнения,
	ХарактеристикаДатыСравнения)

	Если ПервыйАктивныйДоговор = Неопределено Или МинимальнаяДата = Неопределено Или МаксимальнаяДата = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ХарактеристикаДатыСравнения = "Min" Тогда
		НужнаяДата = МинимальнаяДата;
	Иначе
		НужнаяДата = МаксимальнаяДата;
	КонецЕсли;

	Если ОператорСравнения = "Равно" Тогда
		Возврат (ПервыйАктивныйДоговор = НужнаяДата);
	Иначе
		Возврат (ПервыйАктивныйДоговор <> НужнаяДата);
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
// Проверяем на доп условия. Если дата отправки решения:
//  1-10 число, тогда не выводим ведомости "Если число (день) даты ведомости равно числу текущей даты"
// 11-20 число, тогда не выводим ведомости "Если число (день) даты ведомости является чётным"
// 21-31 число, тогда не выводим ведомости "Если месяц даты ведомости является нечётным"
Функция ПроверитьПоДопУсловиям(ДатаОтправки, ДатаВедомости)
	
	ДеньОтправки 	= День(ДатаОтправки);
	ДеньВедомости 	= День(ДатаВедомости);
	ДеньТекущий 	= День(ТекущаяДатаСеанса());
	МесяцВедомости 	= Месяц(ДатаВедомости);

	Если ДеньОтправки < 11 И ДеньВедомости = ДеньТекущий Тогда
		Возврат Ложь;
	ИначеЕсли ДеньОтправки > 20 И МесяцВедомости % 2 <> 0 Тогда
		Возврат Ложь;
	ИначеЕсли ДеньОтправки >= 11 И ДеньОтправки <= 20 И ДеньВедомости % 2 = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаСервере
// Устанавливает цвет строки таблицы "РеквизитТаблицаНужныеВедомости" в зависимости от статуса документа
Процедура УстановитьЦветСтрокиТаблицы()
	
	УсловноеОформление.Элементы.Очистить();
	
// Проверка: есть ли элементы условного оформления
	Сообщить("Элементов условного оформления: " + УсловноеОформление.Элементы.Количество());
	
// Установим цвет строки в зависимости от статуса документа
	НовыйЭлемент = УсловноеОформление.Элементы.Добавить();
	НовыйЭлемент.Использование = Истина;
	
	ЭлементОтбора = НовыйЭлемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РеквизитТаблицаНужныеВедомости.СтатусВедомости");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыДокументов.Акцептован;
	
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
// Укажем оформляемые поля БЕЗ префикса Объект.
	Поле = НовыйЭлемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("РеквизитТаблицаНужныеВедомости.Ведомость");
	Поле.Использование = Истина;
	
	Сообщить("Условное оформление создано");
	
КонецПроцедуры

//&НаСервере
//// Удаляет лишние ведомости из таблицы "РеквизитТаблицаНужныеВедомости
//Функция УдалитьЛишнееНаСервере()
//	// Собрать все ведомости в массив
//	МассивВедомостей = Новый Массив;
//	Для Каждого СтрокаТаблицы Из Объект.ТаблицаНужныеВедомости Цикл
//		МассивВедомостей.Добавить(СтрокаТаблицы.Ведомость);
//	КонецЦикла;
//	
//	// Получить все данные одним запросом
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	Ведомость.Ссылка КАК Ведомость,
//	|	ВЫБОР
//	|		КОГДА КоличествоДоговоров.Количество ЕСТЬ NULL
//	|			ТОГДА 0
//	|		ИНАЧЕ КоличествоДоговоров.Количество
//	|	КОНЕЦ КАК КоличествоДоговоров
//	|ИЗ
//	|	Документ.Ведомость КАК Ведомость
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (
//	|			ВЫБРАТЬ
//	|				ВедомостьДоговоры.Ссылка КАК Ссылка,
//	|				КОЛИЧЕСТВО(ВедомостьДоговоры.Договор) КАК Количество
//	|			ИЗ
//	|				Документ.Ведомость.Договоры КАК ВедомостьДоговоры
//	|			ГДЕ
//	|				ВедомостьДоговоры.Ссылка В (&СписокВедомостей)
//	|			СГРУППИРОВАТЬ ПО
//	|				ВедомостьДоговоры.Ссылка
//	|		) КАК КоличествоДоговоров
//	|		ПО Ведомость.Ссылка = КоличествоДоговоров.Ссылка
//	|ГДЕ
//	|	Ведомость.Ссылка В (&СписокВедомостей)";
//
//	Запрос.УстановитьПараметр("СписокВедомостей", МассивВедомостей);
//
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//
//	УдаленныеНомера = Новый СписокЗначений;
//	НомераДляУдаления = Новый Соответствие;
//
//	Пока Выборка.Следующий() Цикл
//		// Проверка четности
//		Если Выборка.КоличествоДоговоров % 2 = 0 Тогда
//			НомерДокумента = Выборка.Ведомость.Номер;
//			УдаленныеНомера.Добавить(НомерДокумента);
//			НомераДляУдаления.Вставить(НомерДокумента, Истина);
//		КонецЕсли;
//	КонецЦикла;
//
//	УдалитьСтрокиПоНомерам(НомераДляУдаления);
//
//	Возврат УдаленныеНомера;
//
//КонецФункции
//
//&НаСервере
//// Удаляет строки таблицы "ТаблицаНужныеВедомости" по номерам ведомостей
//Процедура УдалитьСтрокиПоНомерам(НомераДляУдаления)
//	
//	ТаблицаНужныеВедомости = Объект.ТаблицаНужныеВедомости;
//	
//	Индекс = ТаблицаНужныеВедомости.Количество() - 1;
//	Пока Индекс >= 0 Цикл
//		СтрокаТаблицы = ТаблицаНужныеВедомости[Индекс];
//		НомерДокумента = СтрокаТаблицы.Ведомость.Номер;
//		Если НомераДляУдаления.Получить(НомерДокумента) <> Неопределено Тогда
//			ТаблицаНужныеВедомости.Удалить(Индекс);
//		КонецЕсли;
//		Индекс = Индекс - 1;
//	КонецЦикла;
//	
//КонецПроцедуры

#КонецОбласти
